# while internet functions disabled
import time

self.reply_body = [  # TODO edit the TZ table
    ['12236', '2020-08-10 01:00', 'Кубок Столичної Ліги - Чоловіки', 'проспект Павла Тичини, 22А'],
    ['125', 'Баренбойм', 'Лев'],
    ['1594',  'Олімп', 'Олі'],
    ['1788', 'ДЮСШ-10', 'Д10'],
    ['3823', 'Другов', 'Грігорій', '3828', 'Кулініч', 'Максим', '2110', 'Кіляров', 'Микита', '3821', 'Оліфер', 'Олег',
     '4070', 'Поволяшко',
     'Євген', '1392', 'Піскунов', 'Костянтин', '3824', 'Руденко', 'Олександр',
     '3822', 'Федоренко', 'Дмитро', '222', 'Хижняк', 'Іван', '3825', 'Чілібі',
     'Антон', '4299', 'Шляхов', 'Максим'],
    ['3666', 'Сківка', 'Дмитро', '4285', 'Андрущенко', 'Святослав', '4284',
     'Цимох', 'Руслан', '4064', 'Іванчич', 'Олексій', '4202', 'Ільков',
     'Ярослав', '3681', 'Дейнека', 'Андрій', '4102', 'Денеж', 'Захар', '4198',
     'Долмат', 'Юрій', '4103', 'Кушнір', 'Іван', '4062', 'Лебідь', 'Данило',
     '4065', 'Пищик', 'Євген', '4199', 'Терещук', 'Максим', '4027', 'Федоренко',
     'Данило', '4283', 'Цекоростенський', 'Володимир'],
    ['3821', 'Оліфер', 'Олег'],
    [],
    ['3822', 'Федоренко', 'Дмитро'],
    ['1064', 'Шпаченко', 'Віктор', '4203', 'Ільков', 'Сергій']
]

# actually # TODO change it when internet is enabled
'''
if self.reply_body != 'No Matches!':
    self.user_status = self.reply_body
else:
    PopUpWindow.show_pop_up(internet_requests[language_code][2])
'''
