internet_requests = [
    [],
    ['Отсутствует Интернет!', 'Имя пользователя и/или пароль не совпадают!', 'Не назначено никаких матчей!', 'Вы используете версию ', ', в то время как доступна версия ', '. Пожалуйста, обновитесь!'], 
    []
]

buttons = [
    [],
    ['Отправить', 'Сохранить', 'Сбросить', 'Пропустить', 'Назад', 'Далее'],
    []
]

interval_window = [
    [],
    ['через', 'Вход в зал', 'Жеребьёвка', 'Начало матча', 'Начало партии', 'Конец перерыва'],
    []
]

authorization_window = [
    [],
    ['Имя пользователя', 'Пароль', 'Запомнить меня'],
    []
]

coin_toss_window = [
    [],
    ['А', 'Б', 'Подача', 'Приём'],
    []
]

team_set_up = [
    [],
    ['Имя', 'П', 'К', 'Л', '#', 'Игроки', 'Персонал'],
    []
]

team_set_up_errors = [
    [],
    ['Недостаточное кол-во игроков!', 'Неверное кол-во капитанов!', 'Неверное кол-во либеро!',
     'Недостаточное кол-во либеро при таком кол-ве игроков!', 'Либеро не может быть капитаном!', 'Неверный номер!',
     'Номера повторяются!'],
    []
]

substitution_errors = [
    [],
    ['Нет свободных замен!', 'Превышено кол-во замен в одном разыгрывании!', 'Этого игрока больше нельзя заменять!', 'Партнёр по замене:'],
    []
]

sanctions_errors = [
    [],
    ['Удаление вместо замечания на последнем очке!'],
    []
]

protest_window = [
    [],
    ['Протест команды ', '', 'Команда не объявляла протест.\nПодтвердите протест команды.\n(Окно ввода текста появится после окончания матча)'], # From two sides for different languages
    []
]

match_window = [
    [],
    ['Ошибка', 'Тайм-аут', 'Переход', 'У команды ', ' отсутствует постоянный капитан на площадке. Пожалуйста, выберите игрового капитана:'],
    []
]

match_end = [
    [],
    ['Протокол матча\n(нажмите для увеличения)', 'Матч окончен.\nПобеда команды ', '.', 'Отправить протокол', 'Сохранить протокол как PNG', 'Написать комментарий', 'Протест команды ', '', 'Лучший игрок команды ', '', 'Заметки судьи'], # From both sides for different languages
    []
]

tabs = [
    [],
    ['Жеребьёвка', 'Cоставы', 'Расстановка', 'Матч', 'Замены', 'Протесты', 'Санкции'],
    []
]

statuses = [ # TODO another statutes
    [],
    ['ГТ', 'ПТ1', 'ПТ2', 'Д', 'М'],
    []
]